# IsElementWithoutSketch Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SketchEditScope..::..IsElementWithoutSketch Method
SketchEditScope Class See Also
---
Validates if an element can have a sketch but currently does not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public bool IsElementWithoutSketch(
	ElementId elementId
)
```

Visual Basic
---
```text
Public Function IsElementWithoutSketch ( _
	elementId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsElementWithoutSketch(
	ElementId^ elementId
)
```

# ### Parameters
elementId
    Type: Autodesk.Revit.DB..::..ElementId The element id to be checked.
# ### Return Value
True if the element doesn't have a sketch, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SketchEditScope Class
Autodesk.Revit.DB Namespace